# Part 1

--- Day 1: Trebuchet?! ---

Something is wrong with global snow production, and you've been selected to take a look. The Elves have even given you a map; on it, they've used stars to mark the top fifty locations that are likely to be having problems.

You've been doing this long enough to know that to restore snow operations, you need to check all fifty stars by December 25th.

Collect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!

You try to ask why they can't just use a weather machine ("not powerful enough") and where they're even sending you ("the sky") and why your map looks mostly blank ("you sure ask a lot of questions") and hang on did you just say the sky ("of course, where do you think snow comes from") when you realize that the Elves are already loading you into a trebuchet ("please hold still, we need to strap you in").

As they're making the final adjustments, they discover that their calibration document (your puzzle input) has been amended by a very young Elf who was apparently just excited to show off her art skills. Consequently, the Elves are having trouble reading the values on the document.

The newly-improved calibration document consists of lines of text; each line originally contained a specific calibration value that the Elves now need to recover. On each line, the calibration value can be found by combining the first digit and the last digit (in that order) to form a single two-digit number.

For example:

1abc2
pqr3stu8vwx
a1b2c3d4e5f
treb7uchet

In this example, the calibration values of these four lines are 12, 38, 15, and 77. Adding these together produces 142.

In [4]:
import pandas as pd
import re
import io

## Example

In [15]:
ex_string = '''
1abc2
pqr3stu8vwx
a1b2c3d4e5f
treb7uchet'''

df = pd.read_csv(io.StringIO(ex_string),header=None)

df['nums'] = df[0].str.findall(r'\d')

df['to_sum'] = df['nums'].apply(lambda x: int(x[0])*10 + int(x[-1]))

display(df)

df['to_sum'].sum()

             0             nums  to_sum
0        1abc2           [1, 2]      12
1  pqr3stu8vwx           [3, 8]      38
2  a1b2c3d4e5f  [1, 2, 3, 4, 5]      15
3   treb7uchet              [7]      77

142

## Full input

In [17]:
df = pd.read_csv('input.txt',header=None)

df['nums'] = df[0].str.findall(r'\d')

df['to_sum'] = df['nums'].apply(lambda x: int(x[0])*10 + int(x[-1]))

display(df)

df['to_sum'].sum()

                                      0             nums  to_sum
0                        2qlljdqcbeight              [2]      22
1                       eight47srvbfive           [4, 7]      47
2             slconeightfoureight557m38  [5, 5, 7, 3, 8]      58
3    xvqeightwosixnine61eightsn2tdczfhx        [6, 1, 2]      62
4             msixonexch1twokjbdlhchqk1           [1, 1]      11
..                                  ...              ...     ...
995                        qqqnnkq7five              [7]      77
996                          foureight6              [6]      66
997                   crjgvsjxcpgtx8one              [8]      88
998                 nvfive8hvdth6fgnfgh           [8, 6]      86
999                           8hl5eight           [8, 5]      85

[1000 rows x 3 columns]

54990

# Part 2

--- Part Two ---

Your calculation isn't quite right. It looks like some of the digits are actually spelled out with letters: one, two, three, four, five, six, seven, eight, and nine also count as valid "digits".

Equipped with this new information, you now need to find the real first and last digit on each line. For example:

two1nine
eightwothree
abcone2threexyz
xtwone3four
4nineeightseven2
zoneight234
7pqrstsixteen
In this example, the calibration values are 29, 83, 13, 24, 42, 14, and 76. Adding these together produces 281.

What is the sum of all of the calibration values?

Answer:  

Although it hasn't changed, you can still get your puzzle input.

You can also [Share] this puzzle.

## Attempt 1

This one lacks the ability to double dip

So, for example, `oneight` shows up just as 1. Probably it needs to show up as `one` and `eight`

### Example

In [41]:
import sys
sys.version

'3.10.14 (main, May  6 2024, 19:42:50) [GCC 11.2.0]'

In [42]:
x = 'l'
conversion_dict.get(x, x)

'l'

In [43]:
ex_string = '''
two1nine
eightwothree
abcone2threexyz
xtwone3four
4nineeightseven2
zoneight234
7pqrstsixteen'''

conversion_dict = {
    'one': 1,
    'two': 2,
    'three': 3, 
    'four': 4,
    'five': 5,
    'six': 6,
    'seven': 7,
    'eight': 8,
    'nine': 9,
    # 'zero': 0
}

df = pd.read_csv(io.StringIO(ex_string),header=None)

pat_string = '|'.join([r'\d'] + [k for k in conversion_dict.keys()])
print(pat_string)

df['nums'] = df[0].str.findall(pat_string)

def extract_num(s_list):
    s1 = s_list[0]
    s2 = s_list[-1]
    s1 = conversion_dict.get(s1,s1)
    s2 = conversion_dict.get(s2,s2)
    return int(s1)*10 + int(s2)

df['to_sum'] = df['nums'].apply(extract_num)

display(df)

df['to_sum'].sum()

\d|one|two|three|four|five|six|seven|eight|nine

                  0                        nums  to_sum
0          two1nine              [two, 1, nine]      29
1      eightwothree              [eight, three]      83
2   abcone2threexyz             [one, 2, three]      13
3       xtwone3four              [two, 3, four]      24
4  4nineeightseven2  [4, nine, eight, seven, 2]      42
5       zoneight234              [one, 2, 3, 4]      14
6     7pqrstsixteen                    [7, six]      76

281

### Full input

In [44]:
df = pd.read_csv('input.txt',header=None)
df['nums'] = df[0].str.findall(pat_string)
df['to_sum'] = df['nums'].apply(extract_num)
display(df)
df['to_sum'].sum()

,0,nums,to_sum
0,2qlljdqcbeight,"[2, eight]",28
1,eight47srvbfive,"[eight, 4, 7, five]",85
2,slconeightfoureight557m38,"[one, four, eight, 5, 5, 7, 3, 8]",18
3,xvqeightwosixnine61eightsn2tdczfhx,"[eight, six, nine, 6, 1, eight, 2]",82
4,msixonexch1twokjbdlhchqk1,"[six, one, 1, two, 1]",61
...,...,...,...
995,qqqnnkq7five,"[7, five]",75
996,foureight6,"[four, eight, 6]",46
997,crjgvsjxcpgtx8one,"[8, one]",81
998,nvfive8hvdth6fgnfgh,"[five, 8, 6]",56
999,8hl5eight,"[8, 5, eight]",88

54489

In [45]:
# This was too high
54489

54489

## Attempt 2

Fix so that we can "double dip" on numbers see line 2 on output. I want that to show as one then eight.

In [69]:
import re
re.search(r"kev|kyle", 'kkyleevinkev')[0]

'kyle'

In [77]:
ex_string = '''
two1nine
eightwothree
abcone2threexyz
xtwone3four
4nineeightseven2
zoneight234
7pqrstsixteen'''

conversion_dict = {
    'one': 1,
    'two': 2,
    'three': 3, 
    'four': 4,
    'five': 5,
    'six': 6,
    'seven': 7,
    'eight': 8,
    'nine': 9,
    # 'zero': 0
}

pat_string = '|'.join([r'\d'] + [k for k in conversion_dict.keys()])
print(pat_string)

def list_nums_in_string(s):
    res = []
    while my_match := re.search(pat_string, s):
        res.append(my_match[0])
        s = s[my_match.start()+1:]
    return res

def extract_num_from_list(s_list):
    s1 = s_list[0]
    s2 = s_list[-1]
    s1 = conversion_dict.get(s1,s1)
    s2 = conversion_dict.get(s2,s2)
    return int(s1)*10 + int(s2)

print("="*5 + " Test " + "="*20)
df = pd.read_csv(io.StringIO(ex_string),header=None)

df['nums'] = df[0].apply(list_nums_in_string)

df['to_sum'] = df['nums'].apply(extract_num)

display(df)

print(df['to_sum'].sum())

print("\n\n\n" + "="*5 + " Full " + "="*20)
df = pd.read_csv('input.txt',header=None)

df['nums'] = df[0].apply(list_nums_in_string)

df['to_sum'] = df['nums'].apply(extract_num)

display(df)

print(df['to_sum'].sum())

\d|one|two|three|four|five|six|seven|eight|nine
===== Test ====================

                  0                        nums  to_sum
0          two1nine              [two, 1, nine]      29
1      eightwothree         [eight, two, three]      83
2   abcone2threexyz             [one, 2, three]      13
3       xtwone3four         [two, one, 3, four]      24
4  4nineeightseven2  [4, nine, eight, seven, 2]      42
5       zoneight234       [one, eight, 2, 3, 4]      14
6     7pqrstsixteen                    [7, six]      76

281



===== Full ====================

,0,nums,to_sum
0,2qlljdqcbeight,"[2, eight]",28
1,eight47srvbfive,"[eight, 4, 7, five]",85
2,slconeightfoureight557m38,"[one, eight, four, eight, 5, 5, 7, 3, 8]",18
3,xvqeightwosixnine61eightsn2tdczfhx,"[eight, two, six, nine, 6, 1, eight, 2]",82
4,msixonexch1twokjbdlhchqk1,"[six, one, 1, two, 1]",61
...,...,...,...
995,qqqnnkq7five,"[7, five]",75
996,foureight6,"[four, eight, 6]",46
997,crjgvsjxcpgtx8one,"[8, one]",81
998,nvfive8hvdth6fgnfgh,"[five, 8, 6]",56
999,8hl5eight,"[8, 5, eight]",88

54473

In [75]:

list_nums_in_string('zoneight234')

zoneight234
neight234
ight234
34
4

['one', 'eight', '2', '3', '4']

In [65]:
print(pat_string)
re.search(pat_string, 'zoneight234')

\d|one|two|three|four|five|six|seven|eight|nine